#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # azapi_resource.qs101[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "qs101" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {}
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = "eastus"
      [32m+[0m[0m name                      = "tfstate"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/6e4d4d41-20a6-4801-8eec-c769d870e333"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Resources/resourceGroups@2022-09-01"

      [32m+[0m[0m timeouts {}
    }

[1m  # azapi_resource.qs101-account[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "qs101-account" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m enabledRegionSelection = false
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "qs101LabAccount"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = (known after apply)
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.LabServices/labaccounts@2018-10-15"
    }

[1m  # azapi_resource.qs101-lab[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "qs101-lab" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m maxUsersInLab  = 10
                  [32m+[0m[0m userAccessMode = "Restricted"
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "qs101Lab"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = (known after apply)
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.LabServices/labaccounts/labs@2018-10-15"
    }

[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @stemaMSFT, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*